Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/organisations_and_resources.html.txt.tmx
Source language: en
Languages: ga

source: Organisations and resources for primary schools
ga: Eagraíochtaí agus acmhainní do bhunscoileanna

source: The following list of websites and organisations has been compiled to help parents and students
ga: Cuireadh le chéile cur síos ar na láithreáin ghréasáin agus na heagraíochtaí seo a leanas d'fhonn cabhrú le tuismitheoirí agus le daltaí

source: You may find them particularly helpful if your child is starting primary education for the first time
ga: B'fhéidir gur mór an cúnamh duit iad má tá do pháiste ag tosú ar an mbunoideachas den chéad uair

source: You may also find these resources useful if you will be moving to Ireland soon and are looking for information on primary education
ga: B'fhéidir go gcuideoidh na hacmhainní seo leat freisin más amhlaidh a bheidh tú ag aistriú go hÉirinn go gairid agus tú ag iarraidh faisnéise faoin gcóras oideachais anseo

source: The official education portal provided by Ireland's Department of Education and Skills is called Scoilnet
ga: Scoilnet a thugtar ar an tairseach oideachais oifigiúil ag an Roinn Oideachais agus Scileanna

source: It aims to support Ireland’s education community by providing information and advice to students, teachers and parents
ga: Is éard is aidhm di tacú le pobal an oideachais trí bhíthin na faisnéise agus na comhairle a chuirtear ar fáil do dhaltaí, do mhúinteoirí agus do thuismitheoirí

source: Scoilnet offers resources on a wide range of subjects that have been evaluated by subject matter experts to make sure they are relevant to the curricula
ga: Soláthraíonn Scoilnet acmhainní do raon leathan ábhar a measúnaíodh de réir an ábhair bhunata lena bheith cinnte go bhfuil siad oiriúnach do na curaclaim in Éirinn

source: These are resources such as lesson plans, interactive and printable worksheets, notes and multimedia content
ga: I measc na n-acmhainní seo tá pleananna ceachta, bileoga oibre idirghníomhacha inphriontáilte, nótaí agus ábhar ilmheáin

source: Teachers and parents can also get information on current news and events relating to education and parenting
ga: Féadfaidh múinteoirí agus tuismitheoirí faisnéis a fháil freisin faoi scéala agus imeachtaí reatha a bhaineann leis an oideachas agus leis an tuistiú

source: Educate Together is the organisation represents the multi-denominational Educate Together primary schools and associations throughout Ireland
ga: Is í Educate Together eagraíocht ionadaíochta na mbunscoileanna agus na gcomhlachas ilchreidmheach 'Educate Together' ar fud na hÉireann

source: The schools operated by the member associations of Educate Together are fully recognised by the Department of Education and Skills and work under the same regulations and funding structures as other national schools
ga: Is iad ball-chomhlachais Educate Together a riarann na scoileanna seo, a bhfuil lánaitheantas acu ón Roinn Oideachais agus Scileanna agus a oibríonn de réir na rialacha agus na struchtúr maoinithe céanna agus a oibríonn bunscoileanna eile

source: However, they have a distinct ethos
ga: Mar sin féin, tá éiteas faoi leith acu

source: Educate Together schools guarantee equality of access to children irrespective of their social, cultural or religious backgrounds
ga: Cinntíonn scoileanna Educate Together go mbeidh an cead rochtana céanna ag páistí orthu, beag beann ar a gcúlra sóisialta, cultúrtha nó creidimh

source: They also have a high level of parental participation in the operation of the school
ga: Bíonn leibhéal ard rannpháirtíochta freisin ag na tuismitheoirí in oibriú na scoile

source: The Educate Together website has a complete list of Educate Together schools in Ireland and details about how you can organise a start up group and participate in the establishment a new school
ga: Tá liosta iomlán de scoileanna Educate Together ar láithreán gréasáin Educate Together agus gach faisnéis faoi mar is féidir grúpa tosaigh a bhunú agus a bheith páirteach i mbunú scoile nua

source: Gaelscoileanna is the main co-ordinating body for all-Irish schools, both primary and post-primary
ga: Is é Gaelscoileanna an príomhchomhlacht comhordaithe do na scoileanna lán-Ghaeilge, bunscoileanna agus iarbhunscoileanna ar aon

source: It aims to advance the use of Irish as the language of instruction in schools around the country
ga: Is éard is aidhm dó úsáid na teanga Gaeilge a chur ar aghaidh mar theanga teagaisc i scoileanna ar fud na tíre

source: Support is provided to parents who want their children educated through Irish, and to local committees who want to establish all-Irish schools in their own locality
ga: Tugtar tacaíocht do thuismitheoirí ar mian leo go múinfí a bpáistí trí Ghaeilge agus do choistí áitiúla atá ag iarraidh scoileanna lán-Ghaeilge a bhunú ina gceantar féin

source: National Parents Council (Primary)
ga: Comhairlí Náisiúnta na dTuismitheoirí (Bunbhrainse)

source: The National Parents Council – Primary (NPC) is a nationwide organisation that represents the interests of parents of primary school children
ga: Is éard atá i gComhairle Náisiúnta na dTuismitheoirí (Bunbhrainse) (CNT) eagraíocht náisiúnta ionadaíochta do thuismitheoirí daltaí bunscoile

source: It aims to actively involve parents in all aspects of their children’s education, to provide a voice for parents in the development of parents' groups in each school, and to monitor educational development and educational opportunities
ga: Bíonn sí ag iarraidh na tuismitheoirí a chur ag glacadh páirte go gníomhach i ngach gné d'oideachas a bpáistí, guth a thabhairt do na tuismitheoirí i bhforbairt ghrúpaí na dtuismitheoirí i ngach scoil, agus monatóireacht a dhéanamh ar fhorbairt an oideachais agus ar dheiseanna oideachais

source: The Irish National Teachers’ Organisation is the largest teachers’ trade union in Ireland
ga: Is é Cumann Múinteoirí Éireann an ceardchumann múinteoirí is mó in Éirinn

source: It represents teachers at primary level in Ireland and at primary and post-primary level in Northern Ireland
ga: Seasann sé do na múinteoirí ar an mbunleibhéal in Éirinn agus do mhúinteoirí bunscoile agus iar-bhunscoile i dTuaisceart Éireann

source: The INTO website provides information on a number of issues relating to education
ga: Tugann láithreán gréasáin CMÉ faisnéis faoi roinnt ceisteanna a bhaineann leis an oideachas

source: These include teachers’ qualifications and working conditions, school administration issues such as insurance and funding, information on parent-teacher relations, education and employment legislation and a section on classroom resources
ga: Ina measc seo, tá cáilíochtaí na múinteoirí agus coinníollacha oibre, ceisteanna a bhaineann le riarachán na scoile, mar shampla árachas agus maoiniú, faisnéis faoin gcaidreamh idir tuismitheoirí agus múinteoirí, reachtaíocht oideachais agus fostaíochta agus rannóg faoi acmhainní sa seomra ranga

source: Irish Primary Principals Network
ga: Líonra Phríomhoidí Bunscoile Éireann

source: The Irish Primary Principals Network (IPPN) is a professional association of school leaders providing dedicated support and representation for principals and deputy principals
ga: Comhlachas gairmiúil do cheannairí scoile é Líonra Phríomhoidí Bunscoile Éireann (LPBÉ) a thugann tacaíocht thiomnaithe agus a sheasann ar son na bpríomhoidí agus na leas-phríomhoidí

source: It exists to support the continued professional and personal development of primary school principals
ga: Is aidhm dó tacú le forbairt ghairmiúil agus forbairt phearsanta leanúnach na bpríomhoidí bunscoile

source: The IPPN offers its members access to organisational policies, curriculum plans, management resources, legislative issues and professional guidance
ga: Tugann LPBÉ an chaoi dá bhaill teacht ar pholasaithe eagraíochtúla, ar phleananna curaclaim, ar acmhainní bainistíochta, ar cheisteanna reachtaíochta agus ar threoir ghairmiúil

source: They also operate a confidential advisory service and answer profession queries from members
ga: Ina theannta sin oibríonn sé seirbhís chomhairliúcháin faoi rún agus freagraíonn sé ceisteanna gairme na mball

source: Froebel primary and early childhood education
ga: Bun- agus luath-oideachas Froebel

source: The Maynooth University Froebel Department of Primary and Early Childhood Education is a teacher-training college specialising in education using the Froebel method
ga: Coláiste oiliúna múinteoirí atá i an Roinn Froebel don Bhun - agus Luath – Oideachas in Ollscoil Mhá Nuad a dhíríonn ar an oideachas de réir an mhodha Froebel

source: This is a progressive child-centred method of education that fosters quality teaching and learning, creativity, integration and sound practical classroom management
ga: Modh forásach leanbh-lárnach é seo a chothaíonn múineadh agus foghlaim ardcháilíochta, an chruthaíocht, an lánpháirtiú agus bainistíocht fhónta phraiticiúil an tseomra ranga

source: The college offers both undergraduate and postgraduate courses for teachers
ga: Cuireann an coláiste cúrsaí céime agus iarchéime ar fáil do mhúinteoirí

source: The Teaching Council promotes and develops teaching as a profession at primary and post-primary levels
ga: Forbraíonn agus cothaíonn an Chomhairle Mhúinteoireachta an mhúinteoireacht mar ghairm ag leibhéal na bunscoile agus na hiarbhunscoile

source: It provides a forum for presenting the views of the profession on all aspects of the teaching career from initial recruitment to in-career professional development
ga: Cuireann sí fóram ar fáil don lucht gairme inar féidir leo a dtuairimí a chur i láthair faoi gach gné de ghairmréim na múinteoireachta ó staid na hearcaíochta go dtí an fhorbairt ghairmiúil le linn na réime

source: The Council maintains a register of all teachers who teach in recognised schools in Ireland
ga: Coinníonn an Chomhairle clár de na múinteoirí uile a mhúineann i scoileanna aitheanta in Éirinn

source: As the regulatory body for teachers, the Teaching Council produces a code of professional conduct for teachers, which covers standards of teaching, knowledge, skill and competence
ga: Ina cáil mar chomhlacht rialaithe do mhúinteoirí in Éirinn, cuireann an Chomhairle Mhúinteoireachta cód iompraíochta gairmiúla ar fáil do na múinteoirí, a chuimsíonn caighdeáin mhúinteoireachta, eolais, scileanna agus inniúlachta

source: Barnardos is a charitable organisation providing a range of services for parents and children
ga: Cumann carthanachta é Barnardos a chuireann raon seirbhísí ar fáil do thuismitheoirí agus do pháistí

source: Its Information centre has a library which offers advice and information on issues relating to children
ga: Tá leabharlann sa Lárionad Faisnéise a thugann comhairle agus faisnéis ar cheisteanna a bhaineann le páistí

source: This includes information leaflets and booklets on a range of subjects such as child development
ga: Áiríonn sé seo bileoga agus leabhráin faisnéise faoi raon ábhar mar fhorás an linbh

source: In addition the Training and Resources section also offers training to anyone working with children, from parents to carers
ga: Le cois na seirbhíse faisnéise, cuireann an tIonad Náisiúnta Acmhainní do Pháistí oiliúint ar fáil do dhuine ar bith, tuismitheoirí nó cúramóirí, a bhíonn ag obair le páistí

source: The library deals with enquiries from parents, professionals, students and anyone with an interest in any aspect of childcare
ga: Bíonn Seirbhís Leabharlainne agus Faisnéise an INAP ag plé le fiosrúcháin ó thuismitheoirí, ó lucht gairme, ó dhaltaí agus ó dhuine ar bith ar suim leis gné ar bith de chúram leanaí

source: If you choose to educate your child at home, the Home Education Network may be a good source of information for you
ga: Más é do rogha é do pháiste a oiliúint sa bhaile, gach seans gur maith an fhoinse eolais duit an Líonra Oideachais sa Bhaile

source: It is a support and lobby group for home educators
ga: Brúghrúpa tacaíochta é d'oideoirí baile

source: It aims to help parents use the available resources to develop educational techniques suitable for each child’s needs
ga: Is é is aidhm dó cabhrú le tuismitheoirí leas a bhaint as na hacmhainní atá le fáil d'fhonn teicnící a fhorbairt a bheadh oiriúnach do riachtanais gach páiste

source: It also provides a means for the exchange of ideas and experience among home educators through regular meetings and newsletters
ga: Tugann sé caoi freisin smaointe agus ciall cheannaithe a chur á malartú idir na hoideoirí baile trína gcuid cruinnithe agus nuachtlitreacha

source: Irish Society for Autism
ga: Cumann Uathachais na hÉireann (Irish Society for Autism)

source: The Irish Society for Autism (ISA) offers advice and support to those coping with autism
ga: Tugann Cumann Uathachais na hÉireann (CUÉ) comhairle agus tacaíocht dóibh siúd atá ag plé leis an uathachas

source: It runs a drop-in centre in its Dublin office where parents, professionals and students can meet to discuss the problems faced by people with autism
ga: Tá ionad 'buail isteach' aige ina oifig i mBaile Átha Cliath mar ar féidir le tuismitheoirí, lucht gairme agus mic léinn teacht le chéile agus fadhbanna na ndaoine a bhfuil uathachas orthu a phlé

source: It offers members access to audio visual equipment, books, publications and videos
ga: Tugann sé caoi dá bhaill leas a bhaint as fearas closamhairc, leabhair, foilseacháin agus físeáin

source: Foras na Gaeilge is the body responsible for promoting the Irish language
ga: Is é Foras na Gaeilge an comhlacht atá freagrach as an teanga Ghaeilge a chur chun cinn

source: Its website covers a number of areas including the roots of the Irish language and some background on the Gaeltacht areas
ga: Tugann an láithreán gréasáin aige faisnéis faoi roinnt ábhar, lena n-áirítear fréamhacha na teanga Gaeilge agus faisnéis chúlra faoi na Gaeltachtaí

source: The site has a comprehensive list of Irish courses available to both children and adults and covers how Irish is taught in schools
ga: Tá liosta cuimsitheach de na cúrsaí Gaeilge atá le fáil ag páistí agus daoine fásta ar an láithreán, agus faisnéis faoin gcaoi a múintear Gaeilge ar scoil

source: Foras na Gaeilge offers teaching resources to Irish teachers who want to update their skills and also offers advice to parents who want to help improve their children’s Irish
ga: Cuireann Foras na Gaeilge acmhainní teagaisc ar fáil do mhúinteoirí Gaeilge ar mhaith leo a gcuid scileanna a nuashonrú agus comhairle do thuismitheoirí ar mhaith leo cabhrú lena bpáistí feabhas a chur ar a gcuid Gaeilge

source: The website gives details of social outlets where Irish is spoken and provides a list of Irish-language organisations and groups
ga: Tugann an láithreán sonraí faoi láithreacha ina labhraítear Gaeilge go sóisialta agus liosta de na heagraíochtaí agus na grúpaí Gaeilge
